{
    "modelTopology": {
        "class_name": "Sequential",
        "config": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 16,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": null,
                            "distribution": null,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_size": [
                        4,
                        4
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "relu",
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "name": "conv2d_Conv2D13",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        50,
                        50,
                        3
                    ],
                    "dtype": "float32"
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "pool_size": [
                        4,
                        4
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "name": "max_pooling2d_MaxPooling2D13",
                    "trainable": true
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 32,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": null,
                            "distribution": null,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "relu",
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "name": "conv2d_Conv2D14",
                    "trainable": true
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "name": "max_pooling2d_MaxPooling2D14",
                    "trainable": true
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": null,
                            "distribution": null,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "relu",
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "name": "conv2d_Conv2D15",
                    "trainable": true
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "name": "max_pooling2d_MaxPooling2D15",
                    "trainable": true
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_Flatten5",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense9",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 2,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense10",
                    "trainable": true
                }
            }
        ],
        "keras_version": "tfjs-layers 0.8.3",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "paths": [
                ".\/desertVjungle01.weights.bin"
            ],
            "weights": [
                {
                    "name": "conv2d_Conv2D13\/kernel",
                    "shape": [
                        4,
                        4,
                        3,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D13\/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D14\/kernel",
                    "shape": [
                        5,
                        5,
                        16,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D14\/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D15\/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_Conv2D15\/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense9\/kernel",
                    "shape": [
                        576,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense9\/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense10\/kernel",
                    "shape": [
                        32,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense10\/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}